# -*- coding: utf-8 -*-
"""rapa1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1I0DODph1KsOeKOFhu5mElNJAhJOZpSsT
"""

# Task 2
# Напишите программу, которая рассчитывает положение точки относительно окружности.
# Координаты центра окружности и его радиус считываются из файла1.
# Файлы передаются программе в качестве аргументов. Файл с координатами и радиусом окружности - 1 аргумент, файл с координатами точек - 2 аргумент.
#Координаты в диапазоне float.
#Количество точек от 1 до 100.
#Вывод каждого положения точки заканчивается символом новой строки.
#Соответствия ответов:
#0 - точка лежит на окружности 1 - точка внутри
#2 - точка снаружи

with open('file1.txt', "r") as f:
      circle = list(map(float, f.read().split()))
print(circle)

with open('file2.txt', "r") as f:
      # point = [float(i) for i in f.read().split()]
     point = [list(map(float, line.split())) for line in f ]
     
print(point)

x0, y0, r0 = circle
# print(x0, y0, r0)
import math

for k in point:
  if   (k[0] - x0)**2 + (k[1] -y0)**2 == r0**2:
    print(f'Точка на окружности {k[0], k[1]}')
    print(0)
  elif  math.sqrt((k[0] - x0)**2 + (k[1] -y0)**2) < r0:
    print(f'Точка внутри окружности {k[0], k[1]}')
    print(1)
  else: 
    print(f'Точка снаружи {k[0], k[1]}')
    print(2)

# Task 2



